/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "操作を完了できません";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "後でやり直してください。";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "開けません";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "このメディアフォーマットはサポートされていません。";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "開けません";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "このメディアは壊れている可能性があります。";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "開けません";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "このアプリケーションでは、このファイルの再生が認証されていません。"; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "開けません";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "このメディアは使用できません。";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "デコードできません";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "このメディアに必要なデコーダがほかの操作で使用中です。";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "メディアをデコードするほかの操作をすべて停止してからやり直してください。";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "開けません";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "このメディアはこのコンピュータでは使用できません。";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "開けません";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "このコンテンツは外部ディスプレイでは再生できません。";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "開けません";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "現在のシステム構成では保護されたコンテンツを再生できません。";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "トランスコードの出力ビデオトラックのフレーム数が正しくありません";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "トランスコードの出力フレーム数が、編集セグメントのないソースと一致しません";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "デコードできませんでした";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "デコーダでエラーが起きました";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "エンコードできませんでした";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "エンコーダでエラーが起きました";

